#### <b>Pandas</b>
<font size=2>
Pandas contains high-level data structures and manipulation tools designed to make data
analysis fast and easy in Python. pandas is built on top of NumPy and makes it easy to
use in NumPy-centric applications.

Pandas is widely used in data science, machine learning, and data analysis due to its ability to handle large datasets and perform complex data operations efficiently.
</font>

In [1]:
import pandas as pd
import numpy as np      # importing numpy just in case

<font size=3>
Two major data types in Pandas
</font>
<font size=2>

- <b>DataFrame:</b> A two-dimensional, size-mutable, and heterogeneous tabular data structure with labeled axes (rows and columns). It is similar to a spreadsheet or SQL table.
- <b>Series:</b> A one-dimensional, labeled array that can hold any data type. It is like a single column in a DataFrame.

Let's get started with

</font>
<br>
<b>Series</b>
<font size=2>Series is formed from only an array of data:</font>

In [2]:
s1 = pd.Series([4, 7, -5, 3])
s1

0    4
1    7
2   -5
3    3
dtype: int64

<font size=2>
The string representation of a Series displayed interactively shows the index on the left
and the values on the right. Since we did not specify an index for the data, a default
one consisting of the integers 0 through N - 1 (where N is the length of the data) is
created. You can get the array representation and index object of the Series via its values
and index attributes, respectively:
</font>

In [3]:
print(s1.values)
s1.index

[ 4  7 -5  3]

RangeIndex(start=0, stop=4, step=1)

<font size=2>since the above index attribute is returning a range index object we can loop over it</font>

In [4]:
for i in s1.index:
    print(i, end=" ")

0 1 2 3

we can assign our own index for unique identification of each element

In [5]:
s2 = pd.Series([4, 7, -5, 3], index=['a','b','c','d'])
s2

a    4
b    7
c   -5
d    3
dtype: int64

<font size=2>
Compared with a regular NumPy array, you can use values in the index when selecting
single values or a set of values
</font>

In [6]:
print("Accessing element: ",s2['a'],"\n") # accessing the element from series using index
s2['d'] = 6     # assiging element using index
print("Accessing elements using multiple indexes:")
s2[['c', 'a', 'd']] # accessing multiple element using an 
                    # array of indexes

Accessing element:  4

Accessing elements using multiple indexes:

c   -5
a    4
d    6
dtype: int64

<font size=2>
NumPy array operations, such as filtering with a boolean array, scalar multiplication,
or applying math functions, will preserve the index-value link:

</font>

In [7]:
s2[s2 > 0]

a    4
b    7
d    6
dtype: int64

In [8]:
s2 * 2

a     8
b    14
c   -10
d    12
dtype: int64

In [9]:
np.exp(s2)

a      54.598150
b    1096.633158
c       0.006738
d     403.428793
dtype: float64

<font size=2>It can be substituted into many functions that expect a
dict:</font>

In [10]:
print('b' in s2)
print('e' in s2)

True
False

<font size=2>you can create a series from a dictionary as well</font>

In [11]:
sdata = {'Ohio': 35000,
         'Texas': 71000,
         'Oregon': 16000,
         'Utah': 5000}
s3 = pd.Series(sdata)
s3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

<font size=2>what if there are some values not present in series</font>

In [12]:
data = data = {
    'A': 10,
    'B': None,
    'C': 30,
    'D': None,
    'E': 50
}
null_data = pd.Series(data)
print(null_data)

A    10.0
B     NaN
C    30.0
D     NaN
E    50.0
dtype: float64

<font size=2>Above we can see that there is some data not present in series and it is present as <b>None</b> in data but in pandas series it shows <b>NaN</b>.

Check if there is some null value present in data series or not we use isnull() method
</font>

In [13]:
null_data.isnull()

A    False
B     True
C    False
D     True
E    False
dtype: bool

<font size=2><b>sum()</b> method can also be used along with <b>isnull()</b> method to check the number of null values</font>

In [14]:
print("Null values in null_data: ",null_data.isnull().sum())

Null values in null_data:  2

<font size=2>Both the Series object itself and its index have a name attribute, which integrates with
other key areas of pandas functionality:</font>

In [15]:
null_data.name = "rank"
null_data.index.name = "grade"

null_data

grade
A    10.0
B     NaN
C    30.0
D     NaN
E    50.0
Name: rank, dtype: float64

<b>DataFrame</b>
<font size=2>

A DataFrame represents a tabular, spreadsheet-like data structure containing an ordered collection of columns, each of which can be a different value type (numeric,
string, boolean, etc.).
 
The DataFrame has both a row and column index; it can be
thought of as a dict of Series (one for all sharing the same index).
</font>

Creation
<font size=2>

There are numerous ways to construct a DataFrame, though one of the most common
is from a dict of equal-length lists or NumPy arrays</font>

In [16]:
df = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
 'year': [2000, 2001, 2002, 2001, 2002],
 'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}
frame = pd.DataFrame(df)

frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

<font size=2>
If you specify a sequence of columns, the DataFrame’s columns will be exactly what
you pass:
</font>

In [17]:
pd.DataFrame(df, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

<font size=2>
As with Series, if you pass a column that isn’t contained in data, it will appear with NA
values in the result:
</font>

In [18]:
frame2 = pd.DataFrame(df, 
                      columns=['year', 'state', 'pop', 'debt'],
                      index=['one', 'two', 'three', 'four', 'five'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

<font size=2>
A column in a DataFrame can be retrieved as a Series either by dict-like notation or by
attribute
</font>

In [19]:
display(frame2['year'])
display(frame2.state)

one      2000
two      2001
three    2002
four     2001
five     2002
Name: year, dtype: int64

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

<font size=2>rows can also be accessed by position or name using <b>.loc()</b> or <b>.iloc()</b> methods.

- .loc uses user defined names or indexes to access the data

- .iloc uses system defined numerical indexing(0,1,2...) to access data
</font>

In [20]:
frame2.iloc[0]

year     2000
state    Ohio
pop       1.5
debt      NaN
Name: one, dtype: object

In [21]:
frame2.loc['four']

year       2001
state    Nevada
pop         2.4
debt        NaN
Name: four, dtype: object

<font size=2>columns can be assigned values by assignment operators</font>

In [22]:
frame2.debt = 10
frame2

       year   state  pop  debt
one    2000    Ohio  1.5    10
two    2001    Ohio  1.7    10
three  2002    Ohio  3.6    10
four   2001  Nevada  2.4    10
five   2002  Nevada  2.9    10

<font size=2>When assigning lists or arrays to a column, the value’s length must match the length
of the DataFrame. If you assign a Series, it will be instead conformed exactly to the
DataFrame’s index, inserting missing values in any holes:</font>

In [23]:
val = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])
frame2['debt'] = val
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7

<font size=2>Assigning a column that doesn’t exist will create a new column. The del keyword will
delete columns as with a dict:</font>

In [24]:
frame2['eastern'] = frame2.state == 'Ohio'
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False

In [25]:
del frame2['eastern']
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

<font size=2><b>Another common form of data is a nested dict of dicts format:</b></font>

In [26]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
       'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

<font size=2>If passed to DataFrame, it will interpret the outer dict keys as the columns and the inner
keys as the row indices:</font>

In [27]:
frame3 = pd.DataFrame(pop)
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

<font size=2>Like Series, the values attribute returns the data contained in the DataFrame as a 2D
ndarray:</font>

In [28]:
frame3.values

array([[2.4, 1.7],
       [2.9, 3.6],
       [nan, 1.5]])

In [29]:
frame2.values

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, -1.2],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, -1.5],
       [2002, 'Nevada', 2.9, -1.7]], dtype=object)

<b>Index Objects</b>

pandas’s Index objects are responsible for holding the axis labels and other metadata
(like the axis name or names). Any array or other sequence of labels used when constructing a Series or DataFrame is internally converted to an Index:

In [30]:
obj = pd.Series(range(3), index=['a', 'b', 'c'])

In [31]:
index = obj.index
index

Index(['a', 'b', 'c'], dtype='object')

In [32]:
index[1:]

Index(['b', 'c'], dtype='object')

<font size=2>Index objects are immutable and thus can’t be modified by the user.

In addition to being array-like, an Index also functions as a fixed-size set:
<font>

In [33]:
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [34]:
print('Ohio' in frame3.columns)
print(2003 in frame3.index)

True
False

<b>Rindexing</b>

<font size=2>Calling reindex on this Series rearranges the data according to the new index, introducing missing values if any index values were not already present:</font>

In [35]:
rdx = pd.Series([4.5, 7.2, -5.3, 3.6],
              index=['d', 'b', 'a', 'c'])
rdx

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [36]:
rdx2 = rdx.reindex(['a','b','c','d','e'])
rdx2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [37]:
obj.reindex(['a', 'b', 'c', 'd', 'e'], fill_value=0)

a    0
b    1
c    2
d    0
e    0
dtype: int64

<font size=2>For ordered data like time series, it may be desirable to do some interpolation or filling
of values when reindexing. The method option allows us to do this, using a method such
as ffill which forward fills the values:
</font>

In [38]:
rdx3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
# rdx3
rdx3.reindex(range(6),method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

<font size =2 >With DataFrame, reindex can alter either the (row) index, columns, or both. When
passed just a sequence, the rows are reindexed in the result:
</font>

In [39]:
df2 = pd.DataFrame(np.arange(9).reshape((3, 3)),
                index=['a', 'c', 'd'],
                columns=['Ohio', 'Texas', 'California'])
df2

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [40]:
df2 = df2.reindex(['a', 'b', 'c', 'd'])
df2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

<font size=2>The columns can be reindexed using the columns keyword:</font>

In [41]:
states = ['Texas', 'Utah', 'California']
df2.reindex(columns=states)

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0

<b>Drop data</b>

<font size=2>Dropping entries from an axis</font>

In [42]:
data_drop = pd.Series(np.arange(5.),
                      index=['a', 'b', 'c', 'd', 'e'])
data_drop

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [43]:
new_obj = data_drop.drop('c')
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [44]:
data_drop.drop(['d', 'c'])

a    0.0
b    1.0
e    4.0
dtype: float64

With DataFrame, index values can be deleted from either axis:

In [45]:
state_data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                index=['Ohio', 'Colorado', 'Utah', 'New York'],
                columns=['one', 'two', 'three', 'four'])
state_data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [46]:
# dropping rows
state_data.drop(['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [47]:
# dropping column data
display(state_data.drop('two', axis=1))
display(state_data.drop(['two','four'], axis=1))

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [48]:
arr = np.array([[1,2,3,4],
                [5,6,7,8]])
print(arr.sum())
print(arr.sum(axis=1))

36
[10 26]

<b>Indexing, Selection and Filtering</b>

<font size=2>Series indexing (obj[...]) works analogously to NumPy array indexing, except you can use the Series’s index values instead of only integers.</font>

In [49]:
obj2 = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
print(obj2['b'])
print(obj2[1])
print(obj2[2:4])

1.0
1.0
c    2.0
d    3.0
dtype: float64

In [50]:
print(obj2[obj2 < 2])
# Slicing with labels behaves differently than normal Python slicing in that the endpoint
# is inclusive:
obj['b':'c']

a    0.0
b    1.0
dtype: float64

b    1
c    2
dtype: int64

In [51]:
# setting a number of values to a perticular value
obj2['b':'c'] = 6
obj2

a    0.0
b    6.0
c    6.0
d    3.0
dtype: float64

<font size=2>For DataFrame label-indexing on the rows, the special indexing field ix. is used It enables you to select a subset of the rows and columns from a DataFrame with NumPylike notation plus axis labels.</font>

In [52]:
state_data2 =  pd.DataFrame(np.arange(16).reshape((4, 4)),
                index=['Ohio', 'Colorado', 'Utah', 'New York'],
                columns=['one', 'two', 'three', 'four'])
state_data2

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [53]:
state_data2.loc['Ohio',['two','three']]

two      1
three    2
Name: Ohio, dtype: int32

<h2>Note:</h2>

<b>Use .loc() and .iloc() for accessing the rows

Columns can be accessed using column names in square brackets<b>

<b>Arithmetic and data alignment</b>

In [54]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a', 'c', 'e', 'f', 'g'])

display(s1)
display(s2)

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

<font size=2>The internal data alignment introduces NA values in the indices that don’t overlap.</font>

In [55]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In the case of DataFrame, alignment is performed on both the rows and the columns:

In [56]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'),
                index=['Ohio', 'Texas', 'Colorado'])
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
                index=['Utah', 'Ohio', 'Texas', 'Oregon'])
display(df1)
display(df2)

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [57]:
df1+df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [58]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)), columns=list('abcd'))
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)), columns=list('abcde'))
display(df1)
display(df2)

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [59]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [60]:

df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

<b>Function Application and Mapping</b>
<font size=2>

NumPy ufuncs (element-wise array methods) work fine with pandas objects:</font>

In [61]:
frame = pd.DataFrame(np.random.randn(4, 3), columns=list('bde'),
                    index=['Utah', 'Ohio', 'Texas', 'Oregon'])

frame

               b         d         e
Utah    0.773151  1.792116  1.118371
Ohio    0.094001  0.623192 -0.890292
Texas  -0.021107  0.842434 -0.554145
Oregon  1.088995 -0.012622 -0.595792

In [62]:
np.abs(frame)

               b         d         e
Utah    0.773151  1.792116  1.118371
Ohio    0.094001  0.623192  0.890292
Texas   0.021107  0.842434  0.554145
Oregon  1.088995  0.012622  0.595792

<font size=2>Another frequent operation is applying a function on 1D arrays to each column or row.
DataFrame’s apply method does exactly this:</font>

In [63]:
f = lambda x: x.max() - x.min()
frame.apply(f)

b    1.110102
d    1.804738
e    2.008662
dtype: float64

In [64]:
frame.min()

b   -0.021107
d   -0.012622
e   -0.890292
dtype: float64

<font size=2><b>Note:</b> Many of the most common array statistics (like sum and mean) are DataFrame methods,
so using apply is not necessary.</font>

<font size=2>The function passed to apply need not return a scalar value, it can also return a Series
with multiple values:</font>

In [65]:
def f(x):
    return pd.Series([x.min(), x.max()], index=['min', 'max'])

frame.apply(f)

            b         d         e
min -0.021107 -0.012622 -0.890292
max  1.088995  1.792116  1.118371

<b>Sorting and Ranking</b>
<font size=2>

Sorting a data set by some criterion is another important built-in operation. To sort
lexicographically by row or column index, use the sort_index method, which returns
a new, sorted object:

</font>

In [66]:
obj = pd.Series(range(4), index=['d', 'a', 'b', 'c'])
obj

d    0
a    1
b    2
c    3
dtype: int64

In [67]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [68]:
obj.sort_values()

d    0
a    1
b    2
c    3
dtype: int64

<font size=2>With a DataFrame, you can sort by index on either axis:</font>

In [69]:
frame = pd.DataFrame(np.arange(8).reshape((2, 4)), index=['three', 'one'],
                  columns=['d', 'a', 'b', 'c'])
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [70]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [71]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [72]:
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

Ranking is closely related to sorting, assigning ranks from one through the number of
valid data points in an array. It is similar to the indirect sort indices produced by
numpy.argsort, except that ties are broken according to a rule

In [73]:
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])
obj

0    7
1   -5
2    7
3    4
4    2
5    0
6    4
dtype: int64

In [74]:
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

<b>Summarizing and Computing Descriptive Statistics</b>

<font size=2>pandas objects are equipped with a set of common mathematical and statistical methods. Most of these fall into the category of reductions or summary statistics, methods
that extract a single value (like the sum or mean) from a Series or a Series of values from
the rows or columns of a DataFrame. Compared with the equivalent methods of vanilla
NumPy arrays, they are all built from the ground up to exclude missing data.</font>

<font size=2>Consider the following dataframe:</font>

In [75]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
                   [np.nan, np.nan], [0.75, -1.3]],
                   index=['a', 'b', 'c', 'd'],
                   columns=['one', 'two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [76]:
# the sum method
df.sum()

one    9.25
two   -5.80
dtype: float64

In [79]:
# Passing axis=1 sums over the rows instead:
df.sum(axis=1)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [80]:
df.mean(axis=1, skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

<font size=2>Some methods, like idxmin and idxmax, return indirect statistics like the index value
where the minimum or maximum values are attained:
</font>

In [81]:
df.idxmax()

one    b
two    d
dtype: object

In [83]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

<font size=2> `.describe()` is one
such example, producing multiple summary statistics in one shot:</font>

In [84]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

<font size=2>On non-numeric data, describe produces alternate summary statistics:</font>

In [86]:
obj = pd.Series(['a', 'a', 'b', 'c'] * 4)
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

In [89]:
pip install yfinance

^C
Note: you may need to restart the kernel to use updated packages.

Collecting yfinance
  Downloading yfinance-0.2.43-py2.py3-none-any.whl.metadata (11 kB)
Requirement already satisfied: pandas>=1.3.0 in c:\users\aman\appdata\local\programs\python\python310\lib\site-packages (from yfinance) (1.5.0)
Requirement already satisfied: numpy>=1.16.5 in c:\users\aman\appdata\local\programs\python\python310\lib\site-packages (from yfinance) (1.23.3)
Requirement already satisfied: requests>=2.31 in c:\users\aman\appdata\local\programs\python\python310\lib\site-packages (from yfinance) (2.31.0)
Collecting multitasking>=0.0.7 (from yfinance)
  Downloading multitasking-0.0.11-py3-none-any.whl.metadata (5.5 kB)
Requirement already satisfied: lxml>=4.9.1 in c:\users\aman\appdata\local\programs\python\python310\lib\site-packages (from yfinance) (5.2.2)
Requirement already satisfied: platformdirs>=2.0.0 in c:\users\aman\appdata\local\programs\python\python310\lib\site-packages (from yfinance) (4.2.1)
Collecting pytz>=2022.5 (from yfinance)
  Downloading pytz-2024.2-py2.py3-none-any.whl.metadata (22 kB)
Collecting frozendict>=2.3.4 (from yfinance)
  Downloading frozendict-2.4.4-cp310-cp310-win_amd64.whl.metadata (23 kB)
Collecting peewee>=3.16.2 (from yfinance)
  Downloading peewee-3.17.6.tar.gz (3.0 MB)
     ---------------------------------------- 0.0/3.0 MB ? eta -:--:--
     ---------------------------- ----------- 2.1/3.0 MB 11.8 MB/s eta 0:00:01
     ---------------------------------------- 3.0/3.0 MB 10.1 MB/s eta 0:00:00
  Installing build dependencies: started
  Installing build dependencies: finished with status 'done'
  Getting requirements to build wheel: started
  Getting requirements to build wheel: finished with status 'done'
  Preparing metadata (pyproject.toml): started
  Preparing metadata (pyproject.toml): finished with status 'done'
Requirement already satisfied: beautifulsoup4>=4.11.1 in c:\users\aman\appdata\local\programs\python\python310\lib\site-packages (from yfinance) (4.12.2)
Collecting html5lib>=1.1 (from yfinance)
  Downloading html5lib-1.1-py2.py3-none-any.whl.metadata (16 kB)
Requirement already satisfied: soupsieve>1.2 in c:\users\aman\appdata\local\programs\python\python310\lib\site-packages (from beautifulsoup4>=4.11.1->yfinance) (2.5)
Requirement already satisfied: six>=1.9 in c:\users\aman\appdata\local\programs\python\python310\lib\site-packages (from html5lib>=1.1->yfinance) (1.16.0)
Requirement already satisfied: webencodings in c:\users\aman\appdata\local\programs\python\python310\lib\site-packages (from html5lib>=1.1->yfinance) (0.5.1)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\aman\appdata\local\programs\python\python310\lib\site-packages (from pandas>=1.3.0->yfinance) (2.8.2)
Requirement already satisfied: charset-normalizer<4,>=2 in c:\users\aman\appdata\local\programs\python\python310\lib\site-packages (from requests>=2.31->yfinance) (2.1.1)
Requirement already satisfied: idna<4,>=2.5 in c:\users\aman\appdata\local\programs\python\python310\lib\site-packages (from requests>=2.31->yfinance) (3.4)
Requirement already satisfied: urllib3<3,>=1.21.1 in c:\users\aman\appdata\local\programs\python\python310\lib\site-packages (from requests>=2.31->yfinance) (1.26.12)
Requirement already satisfied: certifi>=2017.4.17 in c:\users\aman\appdata\local\programs\python\python310\lib\site-packages (from requests>=2.31->yfinance) (2022.9.14)
Downloading yfinance-0.2.43-py2.py3-none-any.whl (84 kB)
Downloading frozendict-2.4.4-cp310-cp310-win_amd64.whl (37 kB)
Downloading html5lib-1.1-py2.py3-none-any.whl (112 kB)
Downloading multitasking-0.0.11-py3-none-any.whl (8.5 kB)
Downloading pytz-2024.2-py2.py3-none-any.whl (508 kB)
Building wheels for collected packages: peewee
  Building wheel for peewee (pyproject.toml): started
  Building wheel for peewee (pyproject.toml): finished with status 'done'
  Created wheel for peewee: filename=peewee-3.17.6-py3-none-any.whl size=138939 sha256=37f2bb7d77ef53cc4c202f9eb694f8643240210e9d3cc379f02355cdbef0db0e
  Stored in directory: c:\users\aman\appdata\local\pip\cache\wheels\4b\b9\b0\83d6e258e8f963f5ff111a2cd8c483ca59372a86e6a2535212
Successfully built peewee
Installing collected packages: pytz, peewee, multitasking, html5lib, frozendict, yfinance
  Attempting uninstall: pytz
    Found existing installation: pytz 2022.2.1
    Uninstalling pytz-2022.2.1:
      Successfully uninstalled pytz-2022.2.1
Successfully installed frozendict-2.4.4 html5lib-1.1 multitasking-0.0.11 peewee-3.17.6 pytz-2024.2 yfinance-0.2.43

In [90]:
import yfinance as yf
import pandas as pd

# Dictionary to hold stock data
all_data = {}

# Loop through tickers and retrieve data
for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']:
    all_data[ticker] = yf.download(ticker, start='2011-01-01', end='2020-01-01')

# Create a DataFrame for 'Adj Close' prices
price = pd.DataFrame({tic: data['Adj Close'] for tic, data in all_data.items()})

# Create a DataFrame for 'Volume'
volume = pd.DataFrame({tic: data['Volume'] for tic, data in all_data.items()})

print(price.head())  # Example: print the first few rows of the price DataFrame
print(volume.head()) # Example: print the first few rows of the volume DataFrame

[*********************100%***********************]  1 of 1 completed
[*********************100%***********************]  1 of 1 completed
[*********************100%***********************]  1 of 1 completed
[*********************100%***********************]  1 of 1 completed

                 AAPL        IBM       MSFT       GOOG
Date
2011-01-03   9.939776  85.510048  21.546476  15.015455
2011-01-04   9.991653  85.602821  21.631189  14.960049
2011-01-05  10.073383  85.260735  21.561880  15.132727
2011-01-06  10.065242  86.194214  22.193340  15.242792
2011-01-07  10.137321  85.770973  22.023914  15.315838
                 AAPL      IBM      MSFT       GOOG
Date
2011-01-03  445138400  4815575  53443800   94962614
2011-01-04  309080800  5292865  54405600   73253547
2011-01-05  255519600  4871640  58998700  101671667
2011-01-06  300428800  5260543  88026300   82620526
2011-01-07  311931200  4325942  73762000   84363033

In [93]:
volume

                 AAPL      IBM      MSFT       GOOG
Date
2011-01-03  445138400  4815575  53443800   94962614
2011-01-04  309080800  5292865  54405600   73253547
2011-01-05  255519600  4871640  58998700  101671667
2011-01-06  300428800  5260543  88026300   82620526
2011-01-07  311931200  4325942  73762000   84363033
...               ...      ...       ...        ...
2019-12-24   48478800  1257397   8989200    6950000
2019-12-26   93121200  2227666  14520600   13350000
2019-12-27  146266000  2878801  18412800   20768000
2019-12-30  144114400  4308369  16348400   21018000
2019-12-31  100805600  3951265  18369400   19236000

[2264 rows x 4 columns]

In [94]:
price

                 AAPL         IBM        MSFT       GOOG
Date
2011-01-03   9.939776   85.510048   21.546476  15.015455
2011-01-04   9.991653   85.602821   21.631189  14.960049
2011-01-05  10.073383   85.260735   21.561880  15.132727
2011-01-06  10.065242   86.194214   22.193340  15.242792
2011-01-07  10.137321   85.770973   22.023914  15.315838
...               ...         ...         ...        ...
2019-12-24  68.974487  103.070473  150.832993  67.013435
2019-12-26  70.342964  103.017006  152.069321  67.853363
2019-12-27  70.316277  103.291908  152.347260  67.428902
2019-12-30  70.733620  101.413437  151.034241  66.643333
2019-12-31  71.250443  102.352676  151.139664  66.687225

[2264 rows x 4 columns]

In [96]:
returns = price.pct_change()
returns.tail()

                AAPL       IBM      MSFT      GOOG
Date
2019-12-24  0.000950 -0.004205 -0.000191 -0.003914
2019-12-26  0.019840 -0.000519  0.008197  0.012534
2019-12-27 -0.000379  0.002669  0.001828 -0.006256
2019-12-30  0.005935 -0.018186 -0.008619 -0.011650
2019-12-31  0.007307  0.009261  0.000698  0.000659

<font size=2>The corr method of Series computes the correlation of the overlapping, non-NA,
aligned-by-index values in two Series. Relatedly, cov computes the covariance:</font>

In [97]:
returns.MSFT.corr(returns.IBM)

0.47404940735595597

In [99]:
returns.MSFT.cov(returns.IBM)

8.482722810904572e-05

<font size=2>
DataFrame’s corr and cov methods, on the other hand, return a full correlation or
covariance matrix as a DataFrame, respectively:
</font>

In [100]:
returns.corr()

          AAPL       IBM      MSFT      GOOG
AAPL  1.000000  0.361415  0.445623  0.448045
IBM   0.361415  1.000000  0.474049  0.398189
MSFT  0.445623  0.474049  1.000000  0.544580
GOOG  0.448045  0.398189  0.544580  1.000000

<font size=2>Passing a DataFrame computes the correlations of matching column names. Here I
compute correlations of percent changes with volume:</font>

In [101]:
returns.corrwith(volume)

AAPL   -0.078482
IBM    -0.162213
MSFT   -0.064519
GOOG   -0.014697
dtype: float64